Conf.Simple/src/InformationRegisters/SUI_ЛогированиеHTTPЗапросов/SUI_ЛогированиеHTTPЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ЛогированиеHTTPЗапросов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовыйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтносительныйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеОтвета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОтветЕстьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветЖдать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветКоманда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветНетДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>SID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>EnumRef.SUI_HTTPМетоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ЛогированиеHTTPЗапросов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьСхемуПоУмолчанию(АдресСхемы, АдресНастроекКомпоновки) Экспорт
	
	АдресСхемы = ПоместитьВоВременноеХранилище(ПолучитьМакет("ЗаписиЛогирования"), АдресСхемы);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(Компоновщик);
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, АдресСхемы);
	
	ДополнительныеПараметры = Новый Структура("ЗаменятьСуществующий", Ложь);
	
	ГруппаПериод = SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		Компоновщик.Настройки.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ГруппаПериод.Использование = Истина;
	
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ГруппаПериод, "Период", НачалоДня(ТекущаяДатаСеанса()), 
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , ДополнительныеПараметры);
	
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ГруппаПериод, "Период", КонецДня(ТекущаяДатаСеанса()), 
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , ДополнительныеПараметры);
	
	АдресНастроекКомпоновки = ПоместитьВоВременноеХранилище(Компоновщик.ПолучитьНастройки(), АдресНастроекКомпоновки);
	
КонецПроцедуры

Процедура ПолучитьЗаписиЛогирования(Параметры, АдресРезультата) Экспорт
	
	СхемаКомпоновки = ПолучитьМакет("ЗаписиЛогирования");
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(Компоновщик);
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, СхемаКомпоновки);
	
	Если Параметры.Свойство("ПараметрыЗапроса") Тогда
		
		Для Каждого ПараметрЗапроса Из Параметры.ПараметрыЗапроса Цикл
			SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик, ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиКомпоновкиОтбор") Тогда
		SUI_КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Отбор, 
			Параметры.НастройкиКомпоновкиОтбор.Отбор);
	КонецЕсли;
	
	ЭлементПорядка = Компоновщик.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("МеткаВремени");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	
	ПолеПорядка = SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Компоновщик, "СистемныеПоля.НомерПоПорядку");
	
	КоличествоПолучаемыхЗаписей = Неопределено;
	
	Если Параметры.Свойство("КоличествоПоследнихЗаписей") Тогда
		КоличествоПолучаемыхЗаписей = Параметры.КоличествоПоследнихЗаписей;
	ИначеЕсли Параметры.Свойство("КоличествоПервыхЗаписей") Тогда
		
		КоличествоПолучаемыхЗаписей = Параметры.КоличествоПоследнихЗаписей;
		ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ПолеПорядка.Использование = Ложь;
		
	КонецЕсли;
	
	Если КоличествоПолучаемыхЗаписей <> Неопределено Тогда
		
		Если КоличествоПолучаемыхЗаписей > 1000 Тогда
			КоличествоПолучаемыхЗаписей = 1000;
		КонецЕсли;
		
		СхемаЗапроса = Новый СхемаЗапроса();
		СхемаЗапроса.РежимКомпоновкиДанных = Истина;
		СхемаЗапроса.УстановитьТекстЗапроса(СхемаКомпоновки.НаборыДанных[0].Запрос);
		
		ПоследнийПакет = СхемаЗапроса.ПакетЗапросов.Получить(СхемаЗапроса.ПакетЗапросов.Количество() - 1);
		ПоследнийПакет.Операторы.Получить(0).КоличествоПолучаемыхЗаписей = КоличествоПолучаемыхЗаписей;
		
		СхемаКомпоновки.НаборыДанных[0].Запрос = СхемаЗапроса.ПолучитьТекстЗапроса();
		
	КонецЕсли;
	
	ПараметрыРезультат = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных(СхемаКомпоновки);
	ПараметрыРезультат.ВыполнятьВПривилегированномРежиме = Истина;
	
	Если Параметры.Свойство("ТаблицаСписка") Тогда
		
		Для Каждого Колонка Из Параметры.ТаблицаСписка.Колонки Цикл
			
			ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Колонка.Имя);
			ДоступноеПолеВыбора = Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(ПолеКомпоновки);
			
			Если ДоступноеПолеВыбора <> Неопределено Тогда
				SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Компоновщик, ДоступноеПолеВыбора.Поле);
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыРезультат.ОжидаемыеКолонки = Параметры.ТаблицаСписка;
		
	Иначе
		
		Для Каждого ДоступноеПолеВыбора Из Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
			
			Если Не ДоступноеПолеВыбора.Папка Тогда
				SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Компоновщик, ДоступноеПолеВыбора.Поле);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПараметрыРезультат.НастройкиКомпоновкиДанных = Компоновщик.ПолучитьНастройки();
	
	Результат = Новый Структура();
	Результат.Вставить("ТаблицаСписок", 
		SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультат));
	
	Если Не Параметры.Свойство("КоличествоПервыхЗаписей") Тогда
		 
		КолонкаНомерПоПорядку = Результат.ТаблицаСписок.Колонки.Найти("СистемныеПоляНомерПоПорядку");
		
		Если КолонкаНомерПоПорядку <> Неопределено Тогда
			Результат.ТаблицаСписок.Сортировать("СистемныеПоляНомерПоПорядку УБЫВ");
			Результат.ТаблицаСписок.Колонки.Удалить(КолонкаНомерПоПорядку);
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Процедура ПодготовитьФайлВыгрузкиЛогированияHTTPЗапросовВФоне(Параметры, АдресРезультата) Экспорт
	
	Перем ВременныйКаталог;
	
	Попытка
		
		ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
		
		КоличествоКлючей = Параметры.КлючиЗаписей.Количество();
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(КоличествоКлючей > 0 И КоличествоКлючей <= 1000,
			НСтр("ru = 'Количество записей к выгрузке должно быть больше 0 и не больше 1000.'"));
			
		ПараметрыПолученияЗаписей = Новый Структура();
		ПараметрыПолученияЗаписей.Вставить("ПараметрыЗапроса", Новый Структура());
		ПараметрыПолученияЗаписей.ПараметрыЗапроса.Вставить("Период", Новый СписокЗначений());
		ПараметрыПолученияЗаписей.ПараметрыЗапроса.Вставить("SID", Новый СписокЗначений());
		ПараметрыПолученияЗаписей.ПараметрыЗапроса.Вставить("Метод", Новый СписокЗначений());
		
		Для Каждого КлючЗаписи Из Параметры.КлючиЗаписей Цикл
			
			ПараметрыПолученияЗаписей.ПараметрыЗапроса.Период.Добавить(КлючЗаписи.Период);
			ПараметрыПолученияЗаписей.ПараметрыЗапроса.SID.Добавить(КлючЗаписи.SID);
			ПараметрыПолученияЗаписей.ПараметрыЗапроса.Метод.Добавить(КлючЗаписи.Метод);
			
		КонецЦикла;
		
		АдресРезультатаТаблицы = ПоместитьВоВременноеХранилище(Неопределено);
		ПолучитьЗаписиЛогирования(ПараметрыПолученияЗаписей, АдресРезультатаТаблицы);
		РезультатПолучения = ПолучитьИзВременногоХранилища(АдресРезультатаТаблицы);
		УдалитьИзВременногоХранилища(АдресРезультатаТаблицы);
		
		Результат = СформироватьСписокЗаписей(ВременныйКаталог, РезультатПолучения.ТаблицаСписок);
		
		ИмяФайла = "Log.xml";
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, ИмяФайла));
		ЗаписьXML.ЗаписатьБезОбработки(SUI_ОбщегоНазначения.ОбъектXDTOВСтрокуXML(Результат.Список));
		ЗаписьXML.Закрыть();
		
		ФайлАрхив = Новый ЗаписьZipФайла();
		ФайлАрхив.Добавить(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, "*.*"), 
			РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
			РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		ФайлАрхив = ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВременныйКаталог = Неопределено;
		
		ПоместитьВоВременноеХранилище(ФайлАрхив, АдресРезультата);
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации("", , 
			Метаданные.РегистрыСведений.SUI_ЛогированиеHTTPЗапросов, , ИнформацияОбОшибке());
		Если ЗначениеЗаполнено(ВременныйКаталог) Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция СформироватьСписокЗаписей(КаталогДанных, Записи) Экспорт
	
	ТипОписаниеЛогиHTTP = ФабрикаXDTO.Тип("http://www.http-log.simple", "Logs");
	
	Результат = Новый Структура();
	Результат.Вставить("Каталог", "HTTPLogs");
	Результат.Вставить("Список", ФабрикаXDTO.Создать(ТипОписаниеЛогиHTTP));
	
	КоличествоЗаписей = Записи.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ТипЛог = ФабрикаXDTO.Тип("http://www.http-log.simple", "Log");
		ТипURL = ФабрикаXDTO.Тип("http://www.http-log.simple", "URL");
		ТипПользователь = ФабрикаXDTO.Тип("http://www.http-log.simple", "User");
		ТипДанные = ФабрикаXDTO.Тип("http://www.http-log.simple", "Data");
		
		ПутьКаталога = СоздатьКаталогВоВременномКаталоге(КаталогДанных, Результат.Каталог);
		
		Для индекс = 0 По КоличествоЗаписей - 1 Цикл
				
			Лог = ФабрикаXDTO.Создать(ТипЛог);
			Лог.SID = Записи[индекс].SID;
			Лог.Date = Записи[индекс].Период;
			Лог.Method = XMLСтрока(Записи[индекс].Метод);
			Лог.StatusCode = Записи[индекс].КодСостояния;
			Лог.DeviceID = Записи[индекс].ИдентификаторУстройства;
			Лог.Session = Записи[индекс].НомерСеанса;
			Лог.Timestamp = Записи[индекс].МеткаВремени;
			
			Лог.URL = ФабрикаXDTO.Создать(ТипURL);
			Лог.URL.URL = Записи[индекс].URL;
			Лог.URL.Base = Записи[индекс].БазовыйURL;
			Лог.URL.Relative = Записи[индекс].ОтносительныйURL;
			Лог.URL.Проверить();
			
			Лог.User = ФабрикаXDTO.Создать(ТипПользователь);
			Лог.User.Name = Записи[индекс].ИмяПользователя;
			Лог.User.ID = Записи[индекс].ИдентификаторПользователя;
			Лог.User.Проверить();
			
			Лог.Data = ФабрикаXDTO.Создать(ТипДанные);
			
			Если Не ПустаяСтрока(Записи[индекс].ДанныеЗапроса) Или
				Не ПустаяСтрока(Записи[индекс].ДанныеОтвета) Тогда
				
				ПутьКаталогаДанныхЗаписи = СоздатьКаталогВоВременномКаталоге(КаталогДанных, 
					SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
					ПутьКаталога.Относительный, Формат(индекс + 1, "ЧН=0; ЧГ=0;")));
				
				Лог.Data.Path = ПутьКаталогаДанныхЗаписи.Относительный;
				
				Если Не ПустаяСтрока(Записи[индекс].ДанныеЗапроса) Тогда
					
					Лог.Data.Request = "Request.json";
					
					ЗаписьJSON = Новый ЗаписьJSON();
					ЗаписьJSON.ОткрытьФайл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
						ПутьКаталогаДанныхЗаписи.Абсолютный, Лог.Data.Request));
					ЗаписьJSON.ЗаписатьБезОбработки(Записи[индекс].ДанныеЗапроса);
					ЗаписьJSON.Закрыть();
					
				КонецЕсли;
				
				Если Не ПустаяСтрока(Записи[индекс].ДанныеОтвета) Тогда
					
					Лог.Data.Response = "Response.json";
					
					ЗаписьJSON = Новый ЗаписьJSON();
					ЗаписьJSON.ОткрытьФайл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
						ПутьКаталогаДанныхЗаписи.Абсолютный, Лог.Data.Response));
					ЗаписьJSON.ЗаписатьБезОбработки(Записи[индекс].ДанныеОтвета);
					ЗаписьJSON.Закрыть();
					
				КонецЕсли;
				
			КонецЕсли;
			
			Лог.Data.Проверить();
			
			Лог.Проверить();
			
			Результат.Список.Log.Добавить(Лог);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат.Список.Проверить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьКаталогВоВременномКаталоге(ВременныйКаталог, Имя)
	
	Путь = Новый Структура();
	Путь.Вставить("Относительный", Имя);
	Путь.Вставить("Абсолютный", SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, Путь.Относительный));
	
	СоздатьКаталог(Путь.Абсолютный);
	
	Файл = Новый Файл(Путь.Абсолютный);
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(Файл.Существует() И Файл.ЭтоКаталог(), 
		СтрШаблон(НСтр("ru = 'Не удалось инициализировать временный каталог (%1)'"), Путь.Относительный));
	
	Возврат Путь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
